Documents/РасчетыПоНалогуНаПрибыль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>РасчетыПоНалогуНаПрибыль</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийНалогНаПрибыль</Name>
					<Comment>Сумма налога на прибыль по данным налогового учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходовПоНалогуНаПрибыль</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасходовПоНалогуНаПрибыль</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьОНАиОНО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Статьи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиОтсроченныхНалоговыхАктивовИОбязательств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНалоговойДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНалоговойДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНалога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаСтатьиПоБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаСтатьиПоНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВременнойРазницы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОНА</Name>
							<Comment>Сумма отсроченных налоговых активов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОНО</Name>
							<Comment>Сумма отсроченных налоговых обязательств</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/РасчетыПоНалогуНаПрибыль/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;
Перем Заголовок;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Возвращает доступные варианты печати документа.
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Проверяет правильность заполнения шапки документа.
//
// Параметры: 
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Организация, СчетДоходовПоНалогуНаПрибыль, СчетРасходовПоНалогуНаПрибыль");

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения табличной части "Статьи"
//
// Параметры: 
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиСтатьи(Отказ, Заголовок)

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Статья, СтавкаНалога");
	Если (Дата < глЗначениеПеременной("ДатаНКУ2015")) Тогда
		СтруктураОбязательныхПолей.Вставить("ВидНалоговойДеятельности");	
	КонецЕсли;

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Статьи", СтруктураОбязательныхПолей, Отказ, Заголовок);	
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиСтатьи()

// Формирует проводку по расходам на сумму текущего налога на прибыль
Процедура ПровестиРасходыПоТекущемуНалогуНаПрибыль()

	Проводка = Движения.Хозрасчетный.Добавить();
	
	Проводка.Период                     = Дата;
	Проводка.Организация                = Организация;
	Проводка.Сумма                      = ТекущийНалогНаПрибыль;
	
	Проводка.СчетДт						= СчетРасходовПоНалогуНаПрибыль;
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СубконтоРасходов1);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СубконтоРасходов2);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СубконтоРасходов3);
	
	Проводка.СчетКт						= ПланыСчетов.Хозрасчетный.РасчетыПоНалогуНаПрибыль;
	
	Проводка.Содержание					= "Расход по налогу на прибыль";

КонецПроцедуры // ПровестиРасходыПоТекущемуНалогуНаПрибыль()
 
// Выполняет движения по регистрам.
//
// Параметры
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	
	ПроводкиБУ = Движения.Хозрасчетный;
	
	Если НЕ РассчитыватьОНАиОНО Тогда
	
		// Просто показываем расходы в размере текущего налога на прибыль
		ПровестиРасходыПоТекущемуНалогуНаПрибыль();
		
		// И на этом прекращаем формирование проводок
		Возврат;
	
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Статья,
	               |	ВложенныйЗапрос.ВидНалоговойДеятельности,
	               |	СУММА(ВложенныйЗапрос.СуммаОНА) КАК СуммаОНА,
	               |	СУММА(ВложенныйЗапрос.СуммаОНО) КАК СуммаОНО,
	               |	СУММА(ВложенныйЗапрос.ОстатокОНА) КАК ОстатокОНА,
	               |	СУММА(ВложенныйЗапрос.ОстатокОНО) КАК ОстатокОНО
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РасчетыПоНалогуНаПрибыльСтатьи.Статья КАК Статья,
	               |		РасчетыПоНалогуНаПрибыльСтатьи.ВидНалоговойДеятельности КАК ВидНалоговойДеятельности,
	               |		РасчетыПоНалогуНаПрибыльСтатьи.СуммаОНА КАК СуммаОНА,
	               |		-(РасчетыПоНалогуНаПрибыльСтатьи.СуммаОНО) КАК СуммаОНО,
	               |		0 КАК ОстатокОНА,
	               |		0 КАК ОстатокОНО
	               |	ИЗ
	               |		Документ.РасчетыПоНалогуНаПрибыль.Статьи КАК РасчетыПоНалогуНаПрибыльСтатьи
	               |	
	               |	ГДЕ
	               |		РасчетыПоНалогуНаПрибыльСтатьи.Ссылка = &Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ХозрасчетныйОстатки.Субконто1,
	               |		ХозрасчетныйОстатки.Субконто2,
	               |		0,
	               |		0,
	               |		ХозрасчетныйОстатки.СуммаОстаток,
	               |		0
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет = &СчетОНА, &МассивСубконто, Организация = &Организация) КАК ХозрасчетныйОстатки
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ХозрасчетныйОстатки.Субконто1,
	               |		ХозрасчетныйОстатки.Субконто2,
	               |		0,
	               |		0,
	               |		0,
	               |		ХозрасчетныйОстатки.СуммаОстаток
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет = &СчетОНО, &МассивСубконто, Организация = &Организация) КАК ХозрасчетныйОстатки) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Статья,
	               |	ВложенныйЗапрос.ВидНалоговойДеятельности
	               |
	               |ИТОГИ СУММА(СуммаОНА), СУММА(СуммаОНО), СУММА(ОстатокОНА), СУММА(ОстатокОНО) ПО
	               |	ОБЩИЕ";
				   
	//Знаки сумм в запросе:
	// 	сумма ОНА и остаток ОНА - всегда положительные числа (как остаток по активному счету)
	// 	сумма ОНО и остаток ОНО - всегда отрицательные числа (как остаток по пассивному счету)
				   
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетОНА", ПланыСчетов.Хозрасчетный.ОтсроченныеНалоговыеАктивы);
	Запрос.УстановитьПараметр("СчетОНО", ПланыСчетов.Хозрасчетный.ОтсроченныеНалоговыеОбязательства);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивСубконто = Новый Массив(2);
	МассивСубконто[0] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиОтсроченныхНалоговыхАктивовИОбязательств;
	МассивСубконто[1] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыНалоговойДеятельности;
	Запрос.УстановитьПараметр("МассивСубконто", МассивСубконто);
	
	ИтоговаяВыборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаПустая = Истина;
	Пока ИтоговаяВыборка.Следующий() Цикл
		
		ВыборкаПустая = Ложь;
		
		// Общий итог по запросу
	
		// Покажем финансовый результат (доход или расход) по налогу на прибыль
		РазницаОНАиОНО 		= (ИтоговаяВыборка.СуммаОНА + ИтоговаяВыборка.СуммаОНО) - 
								(ИтоговаяВыборка.ОстатокОНА + ИтоговаяВыборка.ОстатокОНО);
								
		ФинРезультатПоНалогуНаПрибыль = ТекущийНалогНаПрибыль - РазницаОНАиОНО;
						
		Если ФинРезультатПоНалогуНаПрибыль > 0 Тогда
		
			// Расход
			Проводка = ПроводкиБУ.Добавить();
			
			Проводка.Период                     = Дата;
			Проводка.Организация                = Организация;
			Проводка.Сумма                      = ФинРезультатПоНалогуНаПрибыль;
			
			Проводка.СчетДт						= СчетРасходовПоНалогуНаПрибыль;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СубконтоРасходов1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СубконтоРасходов2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СубконтоРасходов3);
			
			Проводка.СчетКт						= ПланыСчетов.Хозрасчетный.РасчетыПоНалогуНаПрибыль;
			
			Проводка.Содержание					= "Расход по налогу на прибыль";
		
		ИначеЕсли ФинРезультатПоНалогуНаПрибыль < 0 Тогда
		
			// Доход
			
			Проводка = ПроводкиБУ.Добавить();
			
			Проводка.Период                     = Дата;
			Проводка.Организация                = Организация;
			Проводка.Сумма                      = -ФинРезультатПоНалогуНаПрибыль;
			
			Проводка.СчетДт						= ПланыСчетов.Хозрасчетный.РасчетыПоНалогуНаПрибыль;
			
			Проводка.СчетКт						= СчетДоходовПоНалогуНаПрибыль;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СубконтоДоходов1);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СубконтоДоходов2);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СубконтоДоходов3);
			
			Проводка.Содержание					= "Доход от налога на прибыль";
		
		КонецЕсли; 
		
		Выборка = ИтоговаяВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			
			// Цикл по конкретным статьям и видам налоговой деятельности
			
			// Приводим остатки на счетах ОНА и ОНО в соответствие значениям, указанным в документе
			
			РазницаОНАиОНО 		= (Выборка.СуммаОНА + Выборка.СуммаОНО) - 
									(Выборка.ОстатокОНА + Выборка.ОстатокОНО);
									
			Если РазницаОНАиОНО > 0 Тогда
			
				// Прирост ОНА (уменьшение ОНО)
				
				СуммаПогашенияОНО = 0;
				
				Если Выборка.ОстатокОНО <> 0 Тогда
				
					// Имеется остаток ОНО - погасим его, сколько позволит сумма
					СуммаПогашенияОНО = Мин(РазницаОНАиОНО, -Выборка.ОстатокОНО);
					
					Проводка = ПроводкиБУ.Добавить();
					Проводка.Период                     = Дата;
					Проводка.Организация                = Организация;
					Проводка.Сумма                      = СуммаПогашенияОНО;
					
					Проводка.СчетДт						= ПланыСчетов.Хозрасчетный.ОтсроченныеНалоговыеОбязательства;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиОтсроченныхНалоговыхАктивовИОбязательств", Выборка.Статья);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ВидыНалоговойДеятельности", Выборка.ВидНалоговойДеятельности);
					
					Проводка.СчетКт						= ПланыСчетов.Хозрасчетный.РасчетыПоНалогуНаПрибыль;
					
					Проводка.Содержание					= "Уменьшение отсроченных налоговых обязательств";
				
				КонецЕсли; 
				
				СуммаВозникновенияОНА = РазницаОНАиОНО - СуммаПогашенияОНО;
				
				Если СуммаВозникновенияОНА <> 0 Тогда
				
					// На оставшуюся сумму покажем увеличение ОНА
					
					Проводка = ПроводкиБУ.Добавить();
					Проводка.Период                     = Дата;
					Проводка.Организация                = Организация;
					Проводка.Сумма                      = СуммаВозникновенияОНА;
					
					Проводка.СчетДт						= ПланыСчетов.Хозрасчетный.ОтсроченныеНалоговыеАктивы;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "СтатьиОтсроченныхНалоговыхАктивовИОбязательств", Выборка.Статья);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ВидыНалоговойДеятельности", Выборка.ВидНалоговойДеятельности);
					
					Проводка.СчетКт						= ПланыСчетов.Хозрасчетный.РасчетыПоНалогуНаПрибыль;
					
					Проводка.Содержание					= "Увеличение отсроченных налоговых активов";
				
				КонецЕсли; 
			
			ИначеЕсли РазницаОНАиОНО < 0 Тогда
			
				// Прирост ОНО (уменьшение ОНА)
				
				СуммаПогашенияОНА = 0;
				
				Если Выборка.ОстатокОНА <> 0 Тогда
				
					// Имеется остаток ОНА - погасим его, сколько позволит сумма
					СуммаПогашенияОНА = Мин(-РазницаОНАиОНО, Выборка.ОстатокОНА);
					
					Проводка = ПроводкиБУ.Добавить();
					Проводка.Период                     = Дата;
					Проводка.Организация                = Организация;
					Проводка.Сумма                      = СуммаПогашенияОНА;
					
					Проводка.СчетДт						= ПланыСчетов.Хозрасчетный.РасчетыПоНалогуНаПрибыль;
					
					Проводка.СчетКт						= ПланыСчетов.Хозрасчетный.ОтсроченныеНалоговыеАктивы;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиОтсроченныхНалоговыхАктивовИОбязательств", Выборка.Статья);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ВидыНалоговойДеятельности", Выборка.ВидНалоговойДеятельности);
					
					Проводка.Содержание					= "Уменьшение отсроченных налоговых активов";
				
				КонецЕсли; 
				
				СуммаВозникновенияОНО = - РазницаОНАиОНО - СуммаПогашенияОНА;
				
				Если СуммаВозникновенияОНО <> 0 Тогда
				
					// На оставшуюся сумму покажем увеличение ОНО
					
					Проводка = ПроводкиБУ.Добавить();
					Проводка.Период                     = Дата;
					Проводка.Организация                = Организация;
					Проводка.Сумма                      = СуммаВозникновенияОНО;
					
					Проводка.СчетДт						= ПланыСчетов.Хозрасчетный.РасчетыПоНалогуНаПрибыль;
					
					Проводка.СчетКт						= ПланыСчетов.Хозрасчетный.ОтсроченныеНалоговыеОбязательства;
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиОтсроченныхНалоговыхАктивовИОбязательств", Выборка.Статья);
					ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ВидыНалоговойДеятельности", Выборка.ВидНалоговойДеятельности);
					
					Проводка.Содержание					= "Увеличение отсроченных налоговых обязательств";
				
				КонецЕсли; 
			
			КонецЕсли; 
		
		КонецЦикла; 
	
	КонецЦикла;
	
	Если ВыборкаПустая Тогда
		
		ПровестиРасходыПоТекущемуНалогуНаПрибыль();
	
	КонецЕсли; 
	
КонецПроцедуры // ДвиженияПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаПроведения"
//
Процедура ОбработкаПроведения(Отказ)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	Если ОбщегоНазначения.ДокументыВПериоде(Ссылка, "Квартал", Новый Структура("Организация", Организация)).Количество() > 0 Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='За указанный период уже существует документ ""';uk='За вказаний період вже існує документ ""'") + Ссылка.Метаданные().Представление() + """", Отказ, Заголовок);
	КонецЕсли;
	
	// Проверим заполнение шапки документа
	ПроверитьЗаполнениеШапки(Отказ, Заголовок);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим заполнение табличной части Статьи
	ПроверитьЗаполнениеТабличнойЧастиСтатьи(Отказ, Заголовок);
	
	// Движения документа по регистрам
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(Отказ, Заголовок);
	
	КонецЕсли; 
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();


КонецПроцедуры
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры
